/*
boolean - значения true/false
byte  -8разрядность -  ОТ -128 ДО 127 8разрядное целое число
char - символ
double - числовое значение с плавающей точной двойной точности
float - число с плавающей точкой одинарной точности
int -32 - ОТ -2, 147,483,648 ДО 2, 147,483,647  целое число
long - 64-  ОТ -9,223,372,036,854,775,808 ДО 9,223,372,036,854,775,807 длинное целое число
short 16- ОТ -32,768 ДО 32,767 короткое целове число
*/


 /*  &  - и
     | - или
      ^ - исключающее или
      || - укороченное или
      && - укороченное или
      ! - не
      */

/*
+=  -=  %=  &=  *=  |=   /=   ^=
 */