//////1.	Создайте программу, которая высчитывает сколько лет осталось до выхода на пенсию или сколько лет назад
//////      человек вышел на пенсию. У мужчин считать пенсионным возрастом 70, у женщин 65.
////
////
//package HomeWork;
//
//class Pensioner {
//    String name;
//    int age;
//
//
//    Pensioner(String name, int age) {
//        this.name = name;
//        this.age = age;
//    }
//
//    public class Pension {
//        public static void main(String[] args) {
//            int[] agelist = new int[70];
//            int max = agelist[70];
//
//            Pensioner male = new Pensioner("Alex", 45);
//
//            for (int i = 1; i < 70; i++) {
//                if (male.age < max) ;
//            }
//
//            System.out.println("max is: " + max);
//        }
//    }
//}
//}
//
//







