package HomeWork;
//Напишите класс "TextEditor", который имеет следующие характеристики:
//        •	Текстовая строка.
//        •	Методы для добавления текста к текущей строке и вывода текущей строки.
//Создайте объект класса "ТекстовыйРедактор" и выполните следующие операции:
//        •	Добавьте несколько строк текста.
//        •	Выведите текущую строку.


class TextEditor {
  String text = "Java";

  System.out.println(Java.length);

}